cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/science'

brew 'ack'
brew 'carthage'
brew 'cmake'
brew 'erlang'
brew 'git'
brew 'homebrew/science/glpk'
brew 'gnupg2'
brew 'go'
brew 'graphviz'
brew 'gsl'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jenv'
brew 'node'
brew 'optipng'
brew 'perl'
brew 'postgresql'
brew 'pyenv'
brew 'python'
brew 'python3'
brew 'ranger'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'ruby-build'
brew 'rbenv'
brew 'tbb'
brew 'thefuck'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'utf8proc'
brew 'vim'
brew 'wget'

cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'docker'
cask 'mactex'
